# first to help with something else from brew
# that needs it

tap 'caskroom/cask'
tap 'caskroom/fonts'

cask 'java' unless system '/usr/libexec/java_home --failfast'

brew 'automake'
brew 'chruby'
brew 'dnsmasq'
brew 'elasticsearch'
brew 'fish'
brew 'ffmpeg', args: ['with-fdk-aac' 'with-faac', 'with-libass']
brew 'gawk'
brew 'git'
brew 'libdvdcss'
brew 'libtool'
brew 'libxml2'
brew 'lynx'
brew 'media-info'
brew 'mkvtoolnix'
brew 'mysql'
brew 'namebench'
brew 'postgresql'
brew 'python'
brew 'python3'
brew 'ruby-install'
brew 'sqlite'
brew 'wget'
brew 'youtube-dl'
brew 'yuicompressor'
brew 'zsh-completions'

cask 'aegisub'
cask 'android-file-transfer'
cask 'backblaze-downloader'
cask 'cleanarchiver'
cask 'cyberduck'
# cask 'firefox'
cask 'geekbench'
cask 'heroku-toolbelt'
cask 'imagealpha'
cask 'imageoptim'
# cask 'iterm2'
cask 'kaleidoscope'
cask 'makemkv'
# cask 'plex-media-server'
cask 'the-unarchiver'
cask 'tower'
cask 'utorrent'

cask 'font-source-code-pro'
