# first to help with something else from brew
# that needs it

tap 'heroku/brew'
tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'caskroom/fonts'
tap 'caskroom/cask'

cask 'font-source-code-pro'
cask 'font-open-sans'
cask 'font-fira-code'
cask 'java' unless system '/usr/libexec/java_home --failfast'

brew 'autoconf'
brew 'automake'
brew 'bison'
brew 'boost'
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'gettext'
brew 'libffi'
brew 'glib'
brew 'pixman'
brew 'cairo'
brew 'chruby'
brew 'chruby-fish'
brew 'dnsmasq', restart_service: true
# brew 'elasticsearch'
brew 'faac'
brew 'lame'
brew 'x264'
brew 'xvid'
brew 'ffmpeg', args: ['with-faac', 'with-libass']
brew 'flac'
brew 'fribidi'
brew 'readline'
brew 'gawk'
brew 'gdbm'
brew 'geckodriver'
brew 'git'
brew 'git-flow'
brew 'pkg-config'
brew 'gobject-introspection'
brew 'harfbuzz'
brew 'openssl'
brew 'httrack'
brew 'libass'
brew 'libdvdcss'
brew 'libebml'
brew 'libmagic'
brew 'libmatroska'
brew 'libogg'
brew 'libtool'
brew 'libvo-aacenc'
brew 'libvorbis'
brew 'libxml2'
brew 'libyaml'
brew 'lynx'
brew 'media-info'
brew 'mkvtoolnix'
brew 'mysql', restart_service: true
brew 'namebench'
brew 'neovim'
brew 'node@6'
brew 'postgresql', restart_service: true
brew 'python'
brew 'redis', restart_service: true
brew 'ruby'
brew 'ruby-install'
brew 'terminal-notifier'
brew 'texi2html'
brew 'tree'
brew 'vim'
brew 'watchman'
brew 'wget'
brew 'yarn'
brew 'yasm'
brew 'youtube-dl'
brew 'yuicompressor'
# brew 'zsh-completions'
brew 'heroku/brew/heroku'

# cask 'aegisub'
# cask 'android-file-transfer'
# cask 'backblaze-downloader'
# cask 'cleanarchiver'
# cask 'cyberduck'
# cask 'firefox'
# cask 'geekbench'
# cask 'heroku-toolbelt'
# cask 'imagealpha'
# cask 'imageoptim'
# # cask 'iterm2'
# cask 'kaleidoscope'
# cask 'makemkv'
# # cask 'plex-media-server'
# cask 'the-unarchiver'
# cask 'tower'
# cask 'utorrent'
